<?php
// breadcrumb name
$_['heading_title']                    = '订单详情';
$_['status_pay_status'] = ['0'=>'未支付','1'=>'已支付'];
$_['status_order_status'] = [
        '0'=>'待付款',
        '1'=>'已取消',
        '2'=>'已支付',
        '3'=>'已发货',
        '4'=>'退货中',
        '10'=>'订单完成',
        '11'=>'交易关闭',
        '12'=>'部分发货'
];
$_['status_order_product_status'] =
    [
        '*'=>'全部',
        '0'=>'未发货',
        '1'=>'已发货',
        '2'=>'已收货',
        '3'=>'申请退货',
        '4'=>'退货审核通过',
        '5'=>'退货审核未通过',
        '6'=>'退货成功',
        '7'=>'退货异常',
        '8'=>'已收货，等待退款',
    ];
$_['return_goods_status'] =
    [
        '*'=>'全部',
        '0'=>'',
        '1'=>'退货申请中',
        '2'=>'退货审核通过',
        '3'=>'退货审核不通过',
        '4'=>'客户已发货',
        '5'=>'已收货，等待退款',
        '6'=>'退货款已经返还',
        '7'=>'退货完成',
        '8'=>'退货关闭'
    ];
//case '4':return '退货：客户已发货';
//        case '5':return '退货：供货商已收货';
//        case '6':return '退货：退货款已经返还';
//        case '7':return '退货：退货完成';
//        case '8':return '退货：退货关闭';
$_['status_order_product'] =
    [
        '*'=>'全部',
        '0'=>'未发货',
        '1'=>'已发货，未收货',
        '2'=>'已收货'
    ];