<?php
// breadcrumb name
$_['heading_title']                    = '订单详情';
$_['status_pay_status'] = ['0'=>'未支付','1'=>'已支付'];
$_['status_order_status'] = [
        '0'=>'待付款',
        '1'=>'已取消',
        '2'=>'已支付',
        '3'=>'已发货',
        '4'=>'商品退货中',
//        '5'=>'退货审核通过',
//        '6'=>'退货中',
//        '7'=>'退货成功',
//        '8'=>'退货异常',
//        '9'=>'退货审核不通过',
        '10'=>'订单完成',
        '11'=>'交易关闭',
        '12'=>'部分发货'
];
$_['status_order_product_status'] =
    [
        '*'=>'全部',
        '0'=>'未发货',
        '1'=>'已发货',
        '2'=>'已收货',
        '3'=>'申请退货',
        '4'=>'退货审核通过',
        '5'=>'退货审核未通过',
        '6'=>'退货成功',
        '7'=>'退货异常'
    ];
$_['status_order_product'] =
    [
        '*'=>'全部',
        '0'=>'未发货',
        '1'=>'已发货，未收货',
        '2'=>'已收货'
    ];